---
kind: method
id: M:Autodesk.Revit.Exceptions.DirectoryNotEmptyException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/3e7e030c-5844-bc77-ddbd-9d13106b46ec.htm
---
# Autodesk.Revit.Exceptions.DirectoryNotEmptyException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.